Add project_urls section to pyproject.toml
